import datetime
import requests
import os

TOKEN = os.environ["BOT_TOKEN"]
CHAT_ID = os.environ["CHAT_ID"]

MESSAGES = {
    0: "Пройтись усюди з паличкою, прибрати пил",  # Понеділок
    1: "Розставити красиво настолки",  # Вівторок
    2: "Помити серветники і за потреби досипати/замінити сіль і перець\nПротерти вхідні двері і холодильник",  # Середа
    3: "Протерти полицю з брудним посудом, поправити пакування, розставити красиво на полиці",  # Четвер
    4: "Перевірити що порядок в комірці, прибрати зайве, охайно все поскладати",  # Пʼятниця
    5: "Перевірити що на складі порядок, порозкладати все",  # Субота
    6: "Протерти вхідні двері і холодильник"  # Неділя
}

day = datetime.datetime.utcnow().weekday()
task = MESSAGES[day]

text = f"Нагадування по прибиранню:\n\n{task}"

url = f"https://api.telegram.org/bot{TOKEN}/sendMessage"
requests.post(url, data={
    "chat_id": CHAT_ID,
    "text": text
})
